I've tried to reproduce this but failed, using the latest Terraform & AWS provider versions (1.4.6 and 4.64.0) as well as those you originally reported this with (1.3.6 and 4.46.0).

The setup & output from the basic standalone case I tested is below, but I was also able to exercise it further - modified the new rule it had created, added a second rule, removed the second rule, `terraform destroy`'d for cleanup. Also tried against a couple different regions.

The only errors I got where when - as expected - I tried setting bad configuration types / values and also tried creating a rule with the same name as an existing rule. I didn't see the "The request is rejected because the JSON could not be processed." error at any point in testing.

Not really sure where to go from here - only thought is perhaps it's related to your module setup somehow? Can I suggest trying this standalone config & seeing if that works for you as a baseline?

Terraform version:
```
$ terraform --version
Terraform v1.3.6
on darwin_arm64

Your version of Terraform is out of date! The latest version
is 1.4.6. You can update by downloading from https://www.terraform.io/downloads.html
```
Standalone reproduction configuration:
```
$ cat repro.tf
terraform {
  required_providers {
    aws = {
      source = "hashicorp/aws"
      version = "4.46.0"
    }
  }
}

provider "aws" {
  region = "eu-west-3"
}

resource "aws_guardduty_detector" "primary" {
  enable = true

  datasources {
    s3_logs {
      enable = true
    }
    kubernetes {
      audit_logs {
        enable = false
      }
    }
    malware_protection {
      scan_ec2_instance_with_findings {
        ebs_volumes {
          enable = true
        }
      }
    }
  }
}

resource "aws_guardduty_filter" "ssh_bruteforce" {
  name        = "ssh-bruteforce-inbound"
  description = "Suppress inbound SSH bruteforce attempts"
  action      = "ARCHIVE"
  detector_id = [aws_guardduty_detector.primary.id](http://aws_guardduty_detector.primary.id/)
  rank        = 1

  finding_criteria {
    criterion {
      field  = "type"
      equals = ["UnauthorizedAccess:EC2/SSHBruteForce"]
    }
    criterion {
      field  = "service.resourceRole"
      equals = ["TARGET"]
    }
 }
}
```

`terraform init` & AWS provider version:
```
$ terraform init

Initializing the backend...

Initializing provider plugins...
- Finding hashicorp/aws versions matching "4.46.0"...
- Installing hashicorp/aws v4.46.0...
- Installed hashicorp/aws v4.46.0 (signed by HashiCorp)

[snip]
Terraform has been successfully initialized!
[snip]
```

`terraform plan`:
```
$ terraform plan

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_guardduty_detector.primary will be created
  + resource "aws_guardduty_detector" "primary" {
      + account_id                   = (known after apply)
      + arn                          = (known after apply)
      + enable                       = true
      + finding_publishing_frequency = (known after apply)
      + id                           = (known after apply)
      + tags_all                     = (known after apply)

      + datasources {
          + kubernetes {
              + audit_logs {
                  + enable = false
                }
            }

          + malware_protection {
              + scan_ec2_instance_with_findings {
                  + ebs_volumes {
                      + enable = true
                    }
                }
            }

          + s3_logs {
              + enable = true
            }
        }
    }

  # aws_guardduty_filter.ssh_bruteforce will be created
  + resource "aws_guardduty_filter" "ssh_bruteforce" {
      + action      = "ARCHIVE"
      + arn         = (known after apply)
      + description = "Suppress inbound SSH bruteforce attempts"
      + detector_id = (known after apply)
      + id          = (known after apply)
      + name        = "ssh-bruteforce-inbound"
      + rank        = 1
      + tags_all    = (known after apply)

      + finding_criteria {
          + criterion {
              + equals     = [
                  + "TARGET",
                ]
              + field      = "service.resourceRole"
              + not_equals = []
            }
          + criterion {
              + equals     = [
                  + "UnauthorizedAccess:EC2/SSHBruteForce",
                ]
              + field      = "type"
              + not_equals = []
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now.
```
`terraform apply`:
```
$ terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_guardduty_detector.primary will be created
  + resource "aws_guardduty_detector" "primary" {
      + account_id                   = (known after apply)
      + arn                          = (known after apply)
      + enable                       = true
      + finding_publishing_frequency = (known after apply)
      + id                           = (known after apply)
      + tags_all                     = (known after apply)

      + datasources {
          + kubernetes {
              + audit_logs {
                  + enable = false
                }
            }

          + malware_protection {
              + scan_ec2_instance_with_findings {
                  + ebs_volumes {
                      + enable = true
                    }
                }
            }

          + s3_logs {
              + enable = true
            }
        }
    }

  # aws_guardduty_filter.ssh_bruteforce will be created
  + resource "aws_guardduty_filter" "ssh_bruteforce" {
      + action      = "ARCHIVE"
      + arn         = (known after apply)
      + description = "Suppress inbound SSH bruteforce attempts"
      + detector_id = (known after apply)
      + id          = (known after apply)
      + name        = "ssh-bruteforce-inbound"
      + rank        = 1
      + tags_all    = (known after apply)

      + finding_criteria {
          + criterion {
              + equals     = [
                  + "TARGET",
                ]
              + field      = "service.resourceRole"
              + not_equals = []
            }
          + criterion {
              + equals     = [
                  + "UnauthorizedAccess:EC2/SSHBruteForce",
                ]
              + field      = "type"
              + not_equals = []
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_guardduty_detector.primary: Creating...
aws_guardduty_detector.primary: Creation complete after 1s [id=c6c3e2300f8f03795c5d4eba72f8c5bc]
aws_guardduty_filter.ssh_bruteforce: Creating...
aws_guardduty_filter.ssh_bruteforce: Creation complete after 1s [id=c6c3e2300f8f03795c5d4eba72f8c5bc:ssh-bruteforce-inbound]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```